# Найдите сумму цифр трехзначного числа. 
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input())
if n // 1000 == 0 and n % 1000 > 99:
     print(n // 100 + n % 10 + n //10 % 10)
else:
     print ('No')